{
    "dw_waterson": {
        "title": "D.W. WATERSON",
        "name": "D.W. Waterson",
        "pronouns": "They/Them",
        "role": "Producer, Director",
        "headshot": "/Image/Headshots/headshot-2.jpg",
        "bio": "D.W. Waterson (they/them) is an award-winning, non-binary/queer filmmaker and world-touring electronic music artist. D.W. recently premiered their critically-acclaimed debut feature film BACKSPOT at the 2023 Toronto International Film Festival, and the 2024 SXSW Film & TV Festival, which the Hollywood Reporter called, “sensitive and stylish” and Letterboxd named, “a visceral debut.” The film stars Evan Rachel Wood and was exec-produced by Elliot Page.\n\nD.W. is also the creative force behind the 6 million-viewed, 40+ time award-winning digital series THAT’S MY DJ. Waterson’s work has garnered a Canadian Screen Award Nomination, 5 Best Director awards, Noteable’s 2017 Director of the Year award and landed them a residency at the 2022 TIFF Filmmaker Lab.\n\nNamed a 2024 Rising Star by Toronto Life, D.W. has been DJing and throwing parties in the Toronto underground for ten years, and has opened for artists such as Peaches and Idris Elba. Alongside directing and producing, D.W. creates original electronic tracks to accompany each of their screen projects and declares that “music and film is the greatest love affair ever known.”\n\nD.W. Waterson is the co-founder of the production company, Night is Y, alongside Devery Jacobs.",
        "notable_works": [
            { "title": "Priyanka – No New Friends", "url": "https://www.youtube.com/watch?v=9zGMgmApAYM&feature=youtu.be" },
            { "title": "Turn Up Charlie", "url": "https://www.youtube.com/watch?v=IOsU1RoI6CM&feature=youtu.be" }
        ],
        "links": [{
                "type": "imdb",
                "url": "https://www.imdb.com/name/nm3585842/?ref_=nv_sr_srsg_7_tt_0_nm_8_in_0_q_dw%2520",
                "img": "https://c.animaapp.com/Wqg9SAYU/img/imdb-logo@2x.png"
            },
            {
                "type": "instagram",
                "url": "https://www.instagram.com/dw_waterson/",
                "img": "https://c.animaapp.com/Wqg9SAYU/img/instagram.svg"
            },
            {
                "type": "youtube",
                "url": "https://www.youtube.com/@DWWaterson24",
                "img": "https://c.animaapp.com/Wqg9SAYU/img/youtube.svg"
            }
        ]
    },
    "devery_jacobs": {
        "title": "DEVERY JACOBS",
        "name": "Kawennáhere Devery Jacobs",
        "pronouns": "She/Her",
        "role": "Producer, Writer, Director, Actor",
        "headshot": "/Image/Headshots/headshot-1.jpg",
        "bio": "Kawennáhere Devery Jacobs is an award-winning actor, filmmaker and one of Hollywood’s most exciting rising stars. As a socially conscious voice from Kahnawà:ke Mohawk Territory, they use their platform to advocate for Indigenous and LGBTQ2S+ rights.\n\nBest known for starring as one of the leads in the Emmy®-nominated series RESERVATION DOGS, Jacobs earned a Gotham Award and back-to-back Critics’ Choice Award nominations. Jacobs also wrote and directed on the series, penning two of the most acclaimed episodes. Recently, Jacobs wrapped production on the highly anticipated comedy film OH. WHAT. FUN. for Amazon MGM.\n\nHer producorial feature debut, BACKSPOT, which is also executive produced by Elliot Page and directed by D.W. Waterson, premiered at TIFF and SXSW. The film achieved “Certified Fresh” status on Rotten Tomatoes,\n\nJacobs is currently writing her debut feature film HIGH STEEL, which was selected as part of the 2025 Sundance Directors Lab.\n\nKawennáhere Devery Jacobs is the co-founder of the production company, Night is Y, alongside D.W. Waterson.",
        "notable_works": [
            { "title": "Marvel Studios' Echo", "url": "https://www.youtube.com/watch?v=AFUKnherhuw&feature=youtu.be" },
            { "title": "Reservation Dogs Season 1", "url": "https://www.youtube.com/watch?v=YWYVTyhFAOU&feature=youtu.be" },
            { "title": "Reservation Dogs Season 2", "url": "https://www.youtube.com/watch?v=PInqPhN5YjQ&feature=youtu.be" },
            { "title": "Reservation Dogs Season 3", "url": "https://www.youtube.com/watch?v=rGz501EhVJs&feature=youtu.be" },
            { "title": "Rhymes for Young Ghouls", "url": "https://www.youtube.com/watch?v=-kk7IxWINLQ&feature=youtu.be" }
        ],
        "links": [{
                "type": "imdb",
                "url": "https://www.imdb.com/name/nm2711203/",
                "img": "https://c.animaapp.com/Wqg9SAYU/img/imdb-logo@2x.png"
            },
            {
                "type": "instagram",
                "url": "https://www.instagram.com/deveryjacobs/",
                "img": "https://c.animaapp.com/Wqg9SAYU/img/instagram.svg"
            },
            {
                "type": "youtube",
                "url": "",
                "img": "https://c.animaapp.com/Wqg9SAYU/img/youtube.svg"
            }
        ]
    }
}